docs/content/assets/graphs/concept.dot
graph main {
    layout=dot
    node [fontname="sans-serif",color="royalblue"]
    graph [fontname="sans-serif",style="rounded",color="gray70"]

    subgraph cluster1 {
        label = "Your computer"
        "QOwnNotes" [style="filled",fillcolor="gray90"]
        "Markdown note files"
        "Nextcloud sync client"
        "QOwnNotes browser extension"
        "Web browser"
    }

    subgraph cluster2 {
        label = "Your Nextcloud server"
        "Nextcloud server"
        "QOwnNotesApi Nextcloud app"
        "Nextcloud Notes server app"
    }
    subgraph cluster3 {
        label = "Your mobile phone"
        "Nextcloud Notes mobile app"
        "Mobile phone"
    }
  
    "QOwnNotes" -- "Markdown note files"
    "QOwnNotes browser extension" -- "QOwnNotes"
    "Web browser" -- "QOwnNotes browser extension"
    "Nextcloud sync client" -- "Markdown note files"
    "Nextcloud sync client" -- "Nextcloud server"
    "QOwnNotesApi Nextcloud app" -- "Nextcloud server"
    "QOwnNotes" -- "QOwnNotesApi Nextcloud app"
    "QOwnNotes" -- "Nextcloud server"
    "Nextcloud Notes server app" -- "Nextcloud server"
    "Nextcloud Notes mobile app" -- "Nextcloud Notes server app"
    "Mobile phone" -- "Nextcloud Notes mobile app"
}
